# encoding: utf-8

require 'rubygems'
require 'sinatra'

get '/' do
  @text = ["違法改造されたドラゴンガン","ぱぁーっと　ぱぁーっと","ご満足いただけましたか？","ゲーム作りたい","優しいだけじゃ困るからな",
    "ここのプリクリ様かわいい","修行僧が起き出す時間になってしまったか","俺自身が井口裕香になることだ","いぐちゆかです！","俺自身がYui Oguraになることだ",
    "ああ＾〜Yui Oguraになるぅ＾〜","小倉唯は私の母になってくれるかもしれなかった女性だ","ﾃﾚﾚｰﾚﾃｰﾚﾚﾚﾚｰﾚｰﾃﾚﾚｰﾚﾃｰﾚﾚﾚﾚｱｲﾜｽﾞｻﾞﾜﾝﾜｰﾝﾜﾝﾜｰﾝｱｯｱｯｱｱｲﾜｽﾞｻﾞﾜｰﾝｱｱｱｯｱｯｱｯｱｱｲﾜｽﾞｻﾞﾜｰﾝﾜｰﾝﾜｰﾝﾜｧﾜｧﾜｧﾄﾞｩｰﾝ",
    "ﾊﾅｼﾞｬﾜｼｬﾝ!","ｼｬｰﾗﾗｯｼｬﾗﾗｼｬｰﾗﾗｯｼｬﾗﾗｼｬｰﾗﾗｯｼｬﾗﾗﾕｰｷｰｶｰｳｰｼｬｰﾗﾗｯﾃﾞｭｰﾝ","お姫様だよ！！","試してみる価値は、あるんじゃない？","驚かせちゃってごめんなさい？",
    "よし、そろそろアマガミSS七咲編でも見て頭おかしくなるか。","今書いてます","学校の許可ぁ？","ちょっと立地見てくる","井口裕香が食事の度に味噌汁の具を訂正するアニメがあるらしい",
    "井口裕香と阿澄佳奈（人妻）が山に登るアニメがあるらしい","宇宙人しばいてくる","🍕","pizza食べたい","自分たちが小林美晴を支えていかなきゃいけない",
    "1クレやったら帰りたくなるゲームを久しぶりにやったら1クレで帰りたくなった。","ゲーム作りたい","ゲーム作りたい","ゲーム作りたい","ゲーム作りたい","ゲーム作りたい",
    "ゲーム作りたい","ゲーム作りたい","ゲーム作りたい"
    ].sample
  erb :index
end

