# encoding: utf-8

require 'rubygems'
require 'sinatra'

$readable_text = [
  "違法改造されたドラゴンガン","ぱぁーっと　ぱぁーっと","ご満足いただけましたか？","ゲーム作りたい","優しいだけじゃ困るからな","かりんとうが切れた",
  "ここのプリクリ様かわいい","俺自身が井口裕香になることだ","いぐちゆかです！","俺自身がYui Oguraになることだ","あたりまえアシュリーだもん！",
  "ああ＾〜Yui Oguraになるぅ＾〜","小倉唯は私の母になってくれるかもしれなかった女性だ","ﾃﾚﾚｰﾚﾃｰﾚﾚﾚﾚｰﾚｰﾃﾚﾚｰﾚﾃｰﾚﾚﾚﾚｱｲﾜｽﾞｻﾞﾜﾝﾜｰﾝﾜﾝﾜｰﾝｱｯｱｯｱｱｲﾜｽﾞｻﾞﾜｰﾝｱｱｱｯｱｯｱｯｱｱｲﾜｽﾞｻﾞﾜｰﾝﾜｰﾝﾜｰﾝﾜｧﾜｧﾜｧﾄﾞｩｰﾝ",
  "ﾊﾅｼﾞｬﾜｼｬﾝ!","ｼｬｰﾗﾗｯｼｬﾗﾗｼｬｰﾗﾗｯｼｬﾗﾗｼｬｰﾗﾗｯｼｬﾗﾗﾕｰｷｰｶｰｳｰｼｬｰﾗﾗｯﾃﾞｭｰﾝ","お姫様だよ！！","試してみる価値は、あるんじゃない？","驚かせちゃってごめんなさい？","一度でいいからデートして…",
  "よし、そろそろアマガミSS七咲編でも見て頭おかしくなるか。","今書いてます","学校の許可ぁ？","ちょっと立地見てくる","井口裕香が食事の度に味噌汁の具を訂正するアニメがあるらしい",
  "井口裕香と阿澄佳奈（人妻）が山に登るアニメがあるらしい","宇宙人しばいてくる","pizza食べたい","自分たちが小林美晴を支えていかなきゃいけない","ダメだからね〜〜〜↑",
  "そうごうくみたてこうじょう","フランク王国の車輪刑！","いまーむねーにー　うーまれーたー","Я люблю маленькую девушку.","ほむらちゃんごめんね私DJになる (0:59) http://nico.ms/sm22591026 #sm22591026",
  "セヴェルナヤへようこそ。","ﾏﾀﾊｺｶﾞﾃﾞﾃｷﾀ","ﾀﾞｯﾀﾗｻｲｼｮｶﾗﾃﾞｷﾙﾐﾔﾌｼﾞﾆﾀﾉﾒﾊﾞｲｲﾀﾞﾛ!","ボードゲームやりたい","ありえないこっとっだっよっねえええええ",
  "ショーパンセックス","へびつかい座プロトコル","すまん……ただ、やはりゆかなは効く……！","高宮なすのです！",
  "ゲーム作りたい","ゲーム作りたい","ゲーム作りたい","ゲーム作りたい","ゲーム作りたい","ゲーム作りたい","ゲーム作りたい","ゲーム作りたい",
  "2回ｲｷﾏｽﾖ~","大坪由佳と大坪由佳のカップルが毎回イチャつくアニメがあるらしい","嗚呼、日高里菜になる","デフコン下げたい","全て理解した",
  "Enjoy!!🍻","駆逐艦のおっぱい…","空飛ぶ獣を串刺しに","アンチモン化インジウム","阿澄佳奈の歌声が五臓六腑に染み渡るんじゃ＾〜","小倉唯の声で肺を満たす",
  "キス！　キス！　キス！","べるさま〜♥","パック剥きたみ","アップルティーの味","富山送り","「エリーのアトリエより留年してる」","魚ターン！",
  "ｹﾛｹﾛ? ｹﾛｹﾛ? ｹﾛｹﾛ?","どうして男の人がここにいるの！","寂しいとか、いつでも考えたことなかったけど",
  "イケナイことってすっごく気持ちいいんだよ","小説書きたい","床塗りたい","家から出たくない","ぱんつぱつんぱつん","そなたぁ♥そなたぁ♥",
  "倫敦どんより","だんだん音も変わってきましたよ","幸福とは何か？それは力が高まり、何も阻む物が無いという感覚だ","スマブラトゥーン.mp4 (1:15) http://nico.ms/sm26739128 #sm26739128",
  "小説ってどうやって書くんですか…？","才能も超えて上昇する！","夜は〜〜〜〜",
  "ハナヤマタ4話2クールおじさんだ","ストライクウィッチーズ2期6話8クールおじさんだ","不器用じゃなきゃ恋はできない","大量の涎でコーティングされた厚めの舌",
  "いつになったらクリエイティブするの？","ねむねむにゃんこっ！！","昭和怪奇譚","池田が数え役満を上がるときに流れている曲",
  "一階席二階席の皆さんも見えてますよおおおおおおおおお","今はまだガーリッシュだからな","「そのゲームはよく知らないけどあらゆるゲームでラッシュはできます」",
  "東京は夜の７時だからな","シンパシー5（シンパシー5とは言ってない）","母があげいもを作りましたよ","たまにあり得ないくらいひどいことが起こるでしょう？","しかもご丁寧にリーチまでかけて",
  "女子大生","ドラムが叩きた〜い","健康にいい事をしているので元気になってる","虹待ちレインドロップ","ダイス撲滅委員会","シャニやってるとノンケになりますね",
  "THERAPY","…Remember Us…","サンドラ・ブロックの化粧が濃すぎる","チェーンソー、あると便利ですよ","これで振り込んでも逆転には至らない…","iPS細胞のポーズ",
  "特急券のポーズ","不甲斐のうてすまんのう","暗槓なら大丈夫だよね","あの人は去年も強かったし","勝って、全国行きたいっすね","これなんだよな","電子レンジを枕元に置いたらめちゃくちゃ便利になった",
  "■せ、ブラジル人だ","vivit_jcのいちばん長い日","ややこしい事がしたい","いつだって誰だって恋したらヒロインだから…","物語紬民","重ゲー","耐え難きを耐え、忍び難きを忍び",
  "Hey, guys.","深夜唐揚げ行為","ハイコンテクスト","【興味があります】","ガキの頃俺は","手軽に遊べるな！！！！！！！！！","手を出したら人生おかしくなる概念好き",
  "僕ね、やきもち焼くマシュが好きなんですよね","また劇場版咲阿知賀編で泣きました","僕はライブラリアウトで勝ちたいんじゃない、デッキからボムが捨てられた時の相手の表情が見たいんだ。",
  "神戸牛","ものすごい違法建築だね！","ゲーム性がある","新刊はありませんじゃあないんだよ"
]
$visual_text = [
  "🍕","ლ三ლ(╹◡╹ლ三ლ)","🍣",
  "https://www.youtube.com/watch?v=EixQ_Owd0fU",
  "pic.twitter.com/wXtXMauNJy","pic.twitter.com/vxSlDCdvj3","pic.twitter.com/UWeElIBtY9","pic.twitter.com/jedHpl9Dxy","pic.twitter.com/GtP8uN04NH",
  "https://t.co/nwciKcO5x1"
]

get '/' do
  @text = ($readable_text + $visual_text).sample
  erb :index
end

get '/api/nareru' do
  case params['type']
  when "readable" then
    text = $readable_text
  when "visual" then
    text = $visual_text
  else
    text = $readable_text + $visual_text
  end
  text.sample
end
